namespace TioRAC.U8GT
{
    internal static class AccentsTablePt
    {
        internal static Dictionary<char, byte> Table = new()
        {
            { 'á', 0xA0 },
            { 'à', (byte)'a' },
            { 'ã', (byte)'a' },
            { 'â', (byte)'a' },
            /*{ 'à', 0x85 },
            { 'ã', 0xC6 },
            { 'â', 0x83 },*/
            { 'é', 0x82 },
            { 'ê', (byte)'e' },
            { 'í', 0xA1 },
            { 'ó', 0xA2 },
            { 'ô', (byte)'o' },
            { 'õ', (byte)'o' },
            { 'ú', 0xA3 },
            { 'ü', 0x81 },
            { 'ç', (byte)'c' },
            //{ 'ç', 0x87 },
            { 'Á', 0x23 },
            { 'À', (byte)'A' },
            { 'Ã', (byte)'A' },
            { 'Â', (byte)'A' },
            { 'É', (byte)'E' },
            { 'Ê', (byte)'E' },
            { 'Í', 0x2B },
            { 'Ó', 0x3C },
            { 'Ô', (byte)'O' },
            { 'Õ', (byte)'O' },
            { 'Ú', 0x3D },
            { 'Ü', 0x9A },
            { 'Ç', (byte)'C' }

            /*{ '"', 0x22 },
            { 'á', 0xA0 },
            { 'à', 0x85 },
            { 'ã', 0xC6 },
            { 'â', 0x83 },
            { 'é', 0x82 },
            { 'ê', 0x88 },
            { 'í', 0xA1 },
            { 'ó', 0xA2 },
            { 'ô', 0x93 },
            { 'õ', 0xE4 },
            { 'ú', 0xA3 },
            { 'ü', 0x81 },
            { 'ç', 0x87 },
            { 'Á', 0x23 },
            { 'À', 0xB7 },
            { 'Ã', 0xC7 },
            { 'Â', 0xB6 },
            { 'É', 0x3E },
            { 'Ê', 0xD2 },
            { 'Í', 0x2B },
            { 'Ó', 0x3C },
            { 'Ô', 0xE2 },
            { 'Õ', 0xE5 },
            { 'Ú', 0x3D },
            { 'Ü', 0x9A },
            { 'Ç', 0x80 }*/
        };
    }
}
